---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDrawInCurrentView
source: html/ace72fd9-8ef9-b43d-277e-30b7809c64e4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDrawInCurrentView Property

Can't draw because Work Plane is at a very sharp angle in this view. Go to another view or redefine the Work Plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawInCurrentView { get; }
```